#+BEGIN_COMMENT
.. title: IMDB LSTM With Tokenization
.. slug: imdb-lstm-with-tokenization
.. date: 2019-09-23 14:14:04 UTC-07:00
.. tags: nlp,lstm,tokenization
.. category: NLP
.. link: 
.. description: Building a LSTM model for the IMDB reviews using a Tokenizer.
.. type: text

#+END_COMMENT
** Set Up the Data
#+begin_src ipython :session lstm :results output :exports both
imdb, info = tensorflow_datasets.load("imdb_reviews",
                                     with_info=True,
                                     as_supervised=True)
#+end_src

#+RESULTS:
: 0.1.0...
: 
: 
: 
: 
: -packages/tensorflow_datasets/core/file_format_adapter.py:209: tf_record_iterator (from tensorflow.python.lib.io.tf_record) is deprecated and will be removed in a future version.
: 
: 
: 
: ent calls will reuse this data.
: shuffle_files=None. This behavior will be deprecated on 2019-08-06, at which point shuffle_files=False will be the default for all splits.


#+begin_src ipython :session lstm :results none
training, testing = imdb["train"], imdb["test"]
#+end_src
